app/views/events/show.html.erb

Attractions: <br>
<% @event.attractions.each do |attr| %>
---
SELECT "attractions".* FROM "attractions" INNER JOIN "attraction_events" ON "attractions"."id" = "attraction_events"."attraction_id" WHERE "attraction_events"."event_id" = ?  [["event_id", 708]]