app/views/venues/show.html.erb

Events: <br>
<% @venue.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."venue_id" = ?  [["venue_id", 35]]