app/controllers/attractions_controller.rb

  def index


    if params[:search]
      @attractions = Attraction.search(params[:search]).order("created_at DESC")
---
SELECT "attractions".* FROM "attractions" ORDER BY created_at DESC

  def show
    @attraction = Attraction.find(params[:id])
---
SELECT  "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]