app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY created_at DESC
---
  def index

    if params[:search]
      @events = Event.search(params[:search]).order("created_at DESC")