app/controllers/venues_controller.rb

  def index
    if params[:search]
      @venues = Venue.search(params[:search]).order("created_at DESC")
---
SELECT "venues".* FROM "venues" ORDER BY created_at DESC

  def show
    @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]