app/views/attractions/show.html.erb


<% @attraction.events.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "attraction_events" ON "events"."id" = "attraction_events"."event_id" WHERE "attraction_events"."attraction_id" = ?  [["attraction_id", 129]]